---
kind: type
id: T:Autodesk.Revit.DB.DirectShapeType
source: html/9c7fdd8b-a899-7ba1-2a0f-ecc5e8fe85db.htm
---
# Autodesk.Revit.DB.DirectShapeType

The type element associated with a DirectShape element. This element includes data reused by DirectShape elements of the same type.

## Syntax (C#)
```csharp
public class DirectShapeType : ElementType
```